The package @code{ratpow} provides functions that find the exponents
of the denominator in a CRE polynomial. If the exponents in the denominator
are needed instead @mref{ratdenom} can be used to extract this denominator
first.

In order to get a list of vars in a CRE polynomial @mref{showratvars} can be
used.

@menu
* Functions and Variables for ratpow::
@end menu

@node Functions and Variables for ratpow, , Top, Top
@section Functions and Variables for ratpow



@anchor{ratp_hipow}
@deffn {Function} ratp_hipow @
@fname{ratp_hipow} (@var{expr}, @var{x}) @

Finds the highest power of the main variable in @code{ratnumer(expr)}



@c ===beg===
@c load("ratpow")$
@c ratp_hipow( x^(5/2) + x^2 , x) => 2;
@c ratp_hipow( x^(5/2) + x^2 , sqrt(x)) => 5;
@c ===end===
@example
(%i1) load("ratpow")$
@group
(%i2) ratp_hipow( x^(5/2) + x^2 , x) => 2;
incorrect syntax: > is not a prefix operator
(5/2) + x^2 , x) => 
                  ^
@end group
@group
(%i2) ratp_hipow( x^(5/2) + x^2 , sqrt(x)) => 5;
incorrect syntax: > is not a prefix operator
+ x^2 , sqrt(x)) => 
                  ^
@end group
@end example
@opencatbox
@category{Package ratpow}
@closecatbox
@end deffn

@anchor{ratp_lopow}
@deffn {Function} ratp_lopow @
@fname{ratp_lopow} (@var{expr}, @var{x}) @

Finds the lowest power of the main variable in @code{ratnumer(expr)}

@c ===beg===
@c load("ratpow")$
@c ratp_lopow( x^(5/2) + x^3 , x);
@c ===end===
@example
(%i1) load("ratpow")$
@group
(%i2) ratp_lopow( x^(5/2) + x^3 , x);
(%o2)                           0
@end group
@end example

Explanation: The CRE is x^3 + (x^(1/2))^5 * x^0.
@opencatbox
@category{Package ratpow}
@closecatbox
@end deffn


@anchor{ratp_coeffs}
@deffn {Function} ratp_coeffs @
@fname{ratp_coeffs} (@var{expr}, @var{x}) @

Generates a list of powers and coefficients of the main variable
@code{ratnumer(expr)}; returned coefficients are in CRE form except for
numbers.

@c ===beg===
@c load("ratpow")$
@c ratp_coeffs( 4*x^3 + x + sqrt(x), x);
@c ratp_coeffs( 4*x^3 + x + sqrt(x), x);
@c ===end===
@example
(%i1) load("ratpow")$
@group
(%i2) ratp_coeffs( 4*x^3 + x + sqrt(x), x);
(%o2)/R/         [[3, 4], [1, 1], [0, sqrt(x)]]
@end group
@group
(%i3) ratp_coeffs( 4*x^3 + x + sqrt(x), x);
(%o3)/R/         [[3, 4], [1, 1], [0, sqrt(x)]]
@end group
@end example
@opencatbox
@category{Package ratpow}
@closecatbox
@end deffn

@anchor{ratp_dense_coeffs}
@deffn {Function} ratp_dense_coeffs @
@fname{ratp_dense_coeffs} (@var{expr}, @var{x}) @

Generates a list of coefficients in @code{ratnumer(expr)}; returned
coefficients are in CRE form except for numbers.

@opencatbox
@category{Package ratpow}
@closecatbox
@end deffn

